{"filename":"2015-06-24.md","date":"2015-06-24","title":"meetups/2015-06-24.md","edition":"48","host":"WAI Paris","sponsors":[],"meetupLink":"https://www.meetup.com/fr-FR/Paris-js/events/223279758/","talks":[{"title":"CSS at scale","extract":"A little reminder about how CSS let's you do shit and how you should\nembrace the BEM methodology to make your code easy to read and write.\n","authors":[{"name":"Matthias Le Brun","url":"https://twitter.com/bloodyowl","avatar":"https://api.microlink.io/?url=https://twitter.com/bloodyowl&amps;embed=image.url"}],"slides":["http://bloodyowl.github.io/talk-css-at-scale/"],"links":[],"videos":[]},{"title":"ng-build","extract":"ng-build est un build system prévu pour simplifier le développement\nd'applications AngularJS. Basé sur les noms de fichiers, il évite au\nprogrammeur d'avoir à taper du boilerplate pour déclarer ses modules,\ncontrollers, directives et autres. Le prototype actuel est prévu pour\nfonctionner main dans la main avec Gulp, mais la prochaine version sera\npourvue d'une interface CLI et de transformations pour browserify.\n","authors":[{"name":"Jean Dupouy","url":"https://twitter.com/Izeau","avatar":"https://api.microlink.io/?url=https://twitter.com/Izeau&amps;embed=image.url"}],"slides":[],"links":["https://github.com/izeau/ng-build"],"videos":[]},{"title":"Web Analytics Automation Testing – Data beats Opinions","extract":"Web analytics implementation is much more complex than most people think.\nTesting Web Analytics remains a cumbersome and complex task. Basically we\nhave 4 alternatives:\n\n\n1- Blind faith: Trust and wish everything is right… or check only the\npages that are part of your KPIs and funnels and hope for the best.\n\n2- Debuggers & proxies: Visit all pages through a proxy to make sure the\ntags are working as expected. Then wait… and check in your web analytics\ntools of choice to see if it was recorded correctly.\n\n3- Crawlers: Use a high-end tool or something like Web Link Validator.\n\n4- WASP: The Web Analytics Solution Profiler is a sidebar that offers\npage-by-page view of the tags as you surf. The crawler allows you to check\na full site or section of a site.\n\n\nThese approaches may work if you have a few tags in your website but\ndefinitely not if there are more than 500 variables to record, such as\nevents, properties, tags, and so on. In this case, the automation of data\ncorrectness tests becomes crucial.\n\n\nDuring this session we will use a one-year real project to show you how a\ncross-functional team worked together to build a test framework based on\nopen source tools. The team of Web Analyst, Developer in Test and\nProgrammer worked together to build an Web Analytics Testing Framework and\nvalidate the correct Tagging. Our lesson is: “never assume, always check\nas early and as often as possible.”\n","authors":[{"name":"Elalami Lafkih","url":"https://twitter.com/e_lalami","avatar":"https://api.microlink.io/?url=https://twitter.com/e_lalami&amps;embed=image.url"}],"slides":[],"links":[],"videos":[]},{"title":"Websocket vs SSE, j'ai choisi mon camp","extract":"La bataille fait rage entre SSE et Websocket. L'objectif est de détailler\nnotre position sur le sujet, avec choix d’architectures etc.\n","authors":[{"name":"Nicolas Babel","url":"https://twitter.com/nicbaboul","avatar":"https://api.microlink.io/?url=https://twitter.com/nicbaboul&amps;embed=image.url"}],"slides":[],"links":[],"videos":[]}],"body":{"t":"div"}}