{"filename":"2017-11-29.md","date":"2017-11-29","title":"meetups/2017-11-29.md","edition":"69","host":"Google","sponsors":[],"meetupLink":"https://www.meetup.com/fr-FR/Paris-js/events/244179664/","talks":[{"title":"Feel the Glimmer","extract":"Glimmer.js was announced at EmberConf 2017 and makes Ember.js' hyper-fast rendering engine Glimmer available to everyone as a lightweight UI component library for the web. It also leads the way into the future of the Ember.js framework itself.\n\nIn this talk I'll dive deep into the internals of the Glimmer VM, show how it's powers can be leveraged via Glimmer.js and explain what benefits TypeScript that both are written in provides. I'll end with a look into the future and explain how Glimmer.js and Ember.js will form an ecosystem that apps of all sizes can flourish in.\n","authors":[{"name":"Marco Otte-Witte","url":"https://twitter.com/marcoow","avatar":"https://api.microlink.io/?url=https://twitter.com/marcoow&amps;embed=image.url"}],"slides":[],"links":[],"videos":[]},{"title":"Static websites also get hacked: A security primer","extract":"While static websites lack a lot of the security issues found in dynamically generated webapps, they still face plenty of threats. Cross-site scripting, clickjacking, framebusting, referer leakage, and man in the middle attacks all sound awfully nasty, but what are they and why do we need to worry about them? Looking at realistic examples, I explain these kinds of attacks, and outline the tools that modern browsers provide to combat them.\n","authors":[{"name":"Alexander Ottenhoff","url":"https://twitter.com/AlexOttenhoff","avatar":"https://api.microlink.io/?url=https://twitter.com/AlexOttenhoff&amps;embed=image.url"}],"slides":[],"links":[],"videos":[]},{"title":"Coffee.js - How I hacked my coffee machine using JavaScript","extract":"Home automation should make our lives easier, but my Echo can't make me coffee. As a developer who turns caffeine into code, this is unacceptable. The only thing to do was use code to make coffee.\n\nThis is the story of how I hacked an API onto my coffee machine. We'll look at why you would chose JavaScript to hack the machine, what you need to do to take control of a coffee machine (without too many shocks), and what other things we can do with JavaScript and hardware. As we wrap up with a look at what's next for my project, you'll be dreaming of the gadgets in your house that you can't wait to rip open and give an API.\n","authors":[{"name":"Dominik Kundel","url":"https://twitter.com/dkundel","avatar":"https://api.microlink.io/?url=https://twitter.com/dkundel&amps;embed=image.url"}],"slides":["https://speakerdeck.com/dkundel/code-dot-talks-2017-coffee-dot-js-how-i-hacked-my-coffee-machine-using-javascript"],"links":[],"videos":[]}],"body":{"t":"div"}}