{"filename":"2017-01-25.md","date":"2017-01-25","title":"meetups/2017-01-25.md","edition":"61","host":"Paris&Co","sponsors":[],"meetupLink":"https://www.meetup.com/fr-FR/Paris-js/events/237040978/","talks":[{"title":"JavaScript et DOM dans vos terminaux","extract":"Cela fait maintenant quelques mois que je bosse sur la seconde itération\nd'une bibliothèque de mon cru permettant de faire du rendu sur terminaux\nvia une API DOM et CSS-like. Une petite présentation pour en montrer les\npossibilités !\n","authors":[{"name":"Maël Nison","url":"https://twitter.com/arcanis","avatar":"https://api.microlink.io/?url=https://twitter.com/arcanis&amps;embed=image.url"}],"slides":["https://docs.google.com/presentation/d/1NswmLxESHnw9IF5ypSdm3Hx0Hexn-2uKP6jGV2tb6Ac/edit?usp=sharing"],"links":["https://github.com/manaflair/mylittledom"],"videos":[]},{"title":"Real-time applications with GraphQL, Node.js and MQTT","extract":"GraphQL is known as supporting queries and mutations, and now it supports\nsubscriptions as well. With subscriptions clients can get updates pushed\nfrom the server when data they care about changes. In this talk, the\nspeaker will describe how you can build a Real-time application using the\nGraphQL, Node.js and MQTT through a demo.\n","authors":[{"name":"Jacopo Daeli","url":"https://twitter.com/JacopoDaeli","avatar":"https://api.microlink.io/?url=https://twitter.com/JacopoDaeli&amps;embed=image.url"}],"slides":["https://speakerdeck.com/jacopodaeli/paris-dot-js-real-time-apps-with-graphql-node-dot-js-and-mqtt"],"links":["https://github.com/JacopoDaeli/realtime-graphql"],"videos":[]},{"title":"Comment bien choisir son associé business ?","extract":"Après avoir monté breaz.io (racheté par Hired), j'aimerais partager mes\nretours d'expérience pour réussir à identifier les bons profils business\navec lesquels s'associer.\n\n\nJ'aborderais :\n\n- les bonnes questions à poser (pourquoi tu entreprends, quel est ton\nobjectif personnel)\n\n- les profils à éviter (les narcissiques qui veulent la notoriété, les égo\ntrop marqués qui prennent les choses personnellement et sont des freins au\nchangement)\n\n- la checkbox de l'associé business qui sait scaler une entreprise\n(expérience en recrutement d'équipes, en sales, humilité, sait exécuter\ndans la boue, transparence absolue dans la communication, etc.)\n","authors":[{"name":"Jean-loup Karst","url":"https://twitter.com/JeanloupKarst","avatar":"https://api.microlink.io/?url=https://twitter.com/JeanloupKarst&amps;embed=image.url"}],"slides":[],"links":[],"videos":[]},{"title":"Génération dynamiques d'applications avec React, Redux et Cordova","extract":"Pour ses clients, One2Team fournit des apps sur-mesures qui sont conçues\npour répondre à un besoin précis identifié sur le terrain : préparer son\ndaily Scrum, faire un compte rendu de visite de site technique, ...\n\n\nDans ce talk, nous présentons comment React, Redux et Cordova nous\npermettent de proposer en 1 jour une app répondant à chacun de ces besoins\n:\n\nD'abord, React permet de créer des composants modulaires qui peuvent être\nutilisés dans plusieurs contextes suivant les props qui leur sont\nattachés.\n\nEnsuite, nous verrons comment l'utilisation de Redux permet d'avoir des\nactions et reducers génériques et comment les rattacher aux composants\npour avoir un comportement totalement personnalisable entre chaque apps.\n\nOn prendra des exemples pour montrer comment la navigation est elle même\nrendue personnalisable, comment les vues sont instanciées, comment charger\net stocker les données associées aux composants que l'on souhaite.\n\n\nLe talk sera l'occasion de présenter à nouveau les devtools de React et\nRedux qui sont d'une aide importante pour développer sur une telle app\n(visualiser la structure des composants, les actions et le store de\nl'app).\n","authors":[{"name":"Florian Rival","url":"https://twitter.com/Florianrival","avatar":"https://api.microlink.io/?url=https://twitter.com/Florianrival&amps;embed=image.url"}],"slides":["http://slides.com/florianrival/dynamic-apps-react-redux#/"],"links":[],"videos":[]}],"body":{"t":"div"}}