{"filename":"2018-04-25.md","date":"2018-04-25","title":"meetups/2018-04-25.md","edition":"73","host":"LaPiscine.io","sponsors":[],"meetupLink":"https://www.meetup.com/fr-FR/Paris-js/events/249735887/","talks":[{"title":"Event Loop chapter 2","extract":"La magie de NodeJs pour gérer les I/O asynchrone a un nom : l'event loop.\nAprès un premier talk accès sur les erreurs de conception liées à cette event loop c'est le moment d'expliquer certaines de ses subtilités :\n\nsetImmediate vs process.nextTick\nles librairies évènementielles derrière NodeJs\nmonitorer l'event-loop\n","authors":[{"name":"Vincent","url":"https://twitter.com/Vince_Vallet","avatar":"https://api.microlink.io/?url=https://twitter.com/Vince_Vallet&amps;embed=image.url"}],"slides":[],"links":[],"videos":[]},{"title":"3 semaines pour former un dev, C'est possible !","extract":"Lors des 2 derniers mois, 10 nouveaux développeurs sont arrivés chez BAM. Certains avaient déjà fait beaucoup de dev, d'autres sortent juste d'école. Cela fait du monde à former sur nos technos et notre façon de coder !\n\nPour autant, même avec 20% de nouveaux développeurs notre objectif reste le même : Être des experts en React-native.\n\nNotre process de formation était un peu flou et certaines équipes avaient des difficultés à intégrer un nouveau. Grâce à des techniques d'amélioration continue, j'ai pu consolider notre formation et désormais 100% des dev se sentent efficaces quand ils rejoignent leur premier projet. Ce sont ces apprentissages que je veux vous partager.\n","authors":[{"name":"Nicolas","url":"https://twitter.com/nhacsam_","avatar":"https://api.microlink.io/?url=https://twitter.com/nhacsam_&amps;embed=image.url"}],"slides":["https://t.co/kiEUSol7oq"],"links":[],"videos":null},{"title":"Déployer un package sur npm de manière automatisée et en respectant semver avec semantic-release","extract":"Semver est un contrat entre l'auteur d'un package et ses utilisateurs. Si celui-ci n'est pas respecté, l'impact peut être énorme pour ces derniers (application cassée après une mise à jour mineure, notamment). Comment faire, en tant qu'auteur, pour s'assurer qu'on respecte ce contrat ? Présentation de semantic-release, un outil qui a pour but de régler ce problème avec une grosse cuillère d'automatisation et une pincée de convention.\n","authors":[{"name":"Cyrille","url":"https://twitter.com/JesmoDrazik","avatar":"https://api.microlink.io/?url=https://twitter.com/JesmoDrazik&amps;embed=image.url"}],"slides":["https://t.co/WGqHomHj3d"],"links":[],"videos":null}],"body":{"t":"div"}}