{"filename":"2018-06-27.md","date":"2018-06-27","title":"meetups/2018-06-27.md","edition":"75","host":"Oodrive","sponsors":[],"meetupLink":"https://www.meetup.com/fr-FR/Paris-js/events/251583359/","talks":[{"title":"The amazing tale of Internet S01E02: The Dynamic Web era","extract":"An 2000, 368 000 000 d'ordinateurs connectés.\nLes beaux jours de l'ASP, PHP, et l'arrivée de J2PE (ancêtre de JEE) marquent l'entrée dans le web dynamique. Javascript est synonyme de langage de bidouilleurs, lent, et non exempt de failles de sécurité.\nEn 2006, une fissure commence à apparaitre.\nLe Wap prend sa retraite, les netbooks et Smartphones arrivent : une transformation doit s'opérer.\nUn jour, Google annonce son navigateur Chrome, cachant un moteur qui va changer la donne.\n#DynamicWeb #W3C #HTML5 #WebFrameworks #V8\n","authors":[{"name":"Loic Ortola","url":"http://twitter.com/loicortola","avatar":"https://api.microlink.io/?url=https://twitter.com/loicortola&amps;embed=image.url"}],"slides":[],"links":[],"videos":["https://youtu.be/xR4y5zNokc0?t=24m35s"]},{"title":"Machine learning <3 JS : rendez votre navigateur web intelligent","extract":"Faire du machine learning n'est plus seulement réservé aux charmeurs de serpents (pythonistas) ou à ceux ayant accès à des machines puissantes. Dans le cadre du projet PAIR, l'équipe Brain de Google sortait la librairie deeplearn.js qui a depuis lors évolué pour laisser place à TensorFlow.js. Tensorflow.js se base sur WebGL et permet entre autres de construire et d'entrainer des modèles de données dans le navigateur \"from scratch\" ou en utilisant des techniques telles que le \"transfer learning\".\n\nJe vous expliquerai durant ce talk comment nous avons développé une PWA \"intélligente\" en utilisant du machine learning.\n","authors":[{"name":"Anta","url":"https://twitter.com/aidaraanta","avatar":"https://api.microlink.io/?url=https://twitter.com/aidaraanta&amps;embed=image.url"}],"slides":["https://slides.com/antamb/deep-shit-aka-deep-learning-dans-le-navigateur#/"],"links":[],"videos":["https://youtu.be/xR4y5zNokc0?t=44m29s"]},{"title":"Deux fans de React amenés à faire de l’Angular et ce qu’ils en ont appris","extract":"Après avoir travaillé avec React pendant plusieurs années, la providence nous a rassemblé sur le même projet Angular 4 pendant lequel nous avons pu découvrir ses joies et ses peines.\n\nVenez si vous êtes intéressés de découvrir la vie au jour le jour de développeurs React forcés par le destin de travailler avec Angular.\nVenez si vous voulez savoir en quoi ça n’était pas si mal.\n\nEnfin, vous aurez la chance d’apprendre la réponse à la grande question : Quel framework dois-je choisir pour ma prochaine application front, le tout basé sur un retour d'expérience.\n","authors":[{"name":"Loïc Carbonne","url":"https://twitter.com/loiccarbonne","avatar":"https://api.microlink.io/?url=https://twitter.com/loiccarbonne&amps;embed=image.url"}],"slides":["https://slides.com/loiccarbonne/deck-5-3#/"],"links":[],"videos":["https://youtu.be/xR4y5zNokc0?t=1h16m34s"]}],"body":{"t":"div"}}