{"filename":"2018-08-29.md","date":"2018-08-29","title":"meetups/2018-08-29.md","edition":"76","host":"Datadog","sponsors":[],"meetupLink":"https://www.meetup.com/fr-FR/Paris-js/events/251642385/","talks":[{"title":"Build Advanced Search Experiences with a Custom Query Language","extract":"How many checkboxes can you add before your customer just gives up? When working with large, flexible data structures, click-based interfaces quickly become cumbersome; worse, text-based search is often too imprecise. In this talk, I’ll explain how to create a custom query language that allows for complex searches in just a few keystrokes, and how to integrate it seamlessly into a web interface.\n\nThis would be an updated version of the talk I gave at JSConf.eu: https://www.youtube.com/watch?v=P2yB_iEJXyI\n","authors":[{"name":"Adrien Trauth","url":"http://twitter.com/nioufe","avatar":"https://api.microlink.io/?url=https://twitter.com/nioufe&amps;embed=image.url"}],"slides":["http://dtdg.co/advanced-search"],"links":[],"videos":["https://youtu.be/x8pErCJ1bAU?t=7m30s"]},{"title":"Delivering Fast and Beautiful Images and Video","extract":"The average website page weight is 50% images and 25% video. As the images and videos delivered to mobile devices get larger and larger, the load time of websites gets slower and slower. Further complicating matters, there are thousands of screens and devices with varying resolutions and CPU power that receive this content. In this talk, we’ll examine strategies to send the perfect image or video to every device, ensuring a fast, beautiful rendering of your content. We’ll look at how to test our content, and describe responsive images, delivering progressive images, and finally optimizing all of this content for fast delivery to each screen. Attendees will walk away with a better understanding of how to efficiently deliver beautiful images to every device that accesses their content.\n","authors":[{"name":"Doug Sillars","url":"http://twitter.com/dougsillars","avatar":"https://api.microlink.io/?url=https://twitter.com/dougsillars&amps;embed=image.url"}],"slides":["https://www.slideshare.net/dougsillars/"],"links":[],"videos":["https://youtu.be/x8pErCJ1bAU?t=34m26s"]},{"title":"The Amazing Tale of the Web S01E03: The Rise of JS","extract":"Le dernier de la trilogie, the Rise of JS couvrira les 10 dernières années.\nLes beaux jours du web dynamique battent leur plein, et déjà quelques transitions arrivent.\nLe Wap prend sa retraite, les netbooks et Smartphones arrivent : une transformation doit s'opérer.\nUn jour, Google annonce son navigateur Chrome, cachant un moteur qui va changer la donne. #DynamicWeb #W3C #HTML5 #WebFrameworks #V8\n\nCet épisode 3, c'est comprendre la transition du monde dynamique vers un modèle client-serveur, la fracture engendrée par les nouveaux devices, le mouvement des technologies pour répondre à ces nouveaux usages (Node.js, Play, etc...) et bien sur les frameworks JS\n","authors":[{"name":"Loic Ortola","url":"http://twitter.com/loicortola","avatar":"https://api.microlink.io/?url=https://twitter.com/loicortola&amps;embed=image.url"}],"slides":[],"links":[],"videos":["https://youtu.be/x8pErCJ1bAU"]}],"body":{"t":"div"}}