{"filename":"2018-08-30.md","date":"2018-09-26","title":"meetups/2018-08-30.md","edition":"77","host":"Doctolib","sponsors":[],"meetupLink":"https://www.meetup.com/fr-FR/Paris-js/events/251642397/","talks":[{"title":"Comment connecter 1980 et 2018 avec une extension Chrome et Chrome Native Messaging","extract":"Chez Doctolib, nous avons à nous interfacer avec des logiciels allant du site web en SAAS au logiciel natif développé en 1980. Presqu'aucun de ces logiciels n'est prévu pour la communication avec d'autres outils. Nous avons mis en place une architecture multi couches articulée autour d'une extension Chrome : injection d'une API javascript dans les pages de nos partenaires ou lancement d'un binaire avec Chrome Native messaging pour communiquer avec des logiciels installés directement sur le poste de nos clients.\n\nNous présenterons au cours de ce talk la manière de créer une extension Chrome permettant de réaliser ce type d'actions. Nous parlerons ensuite du déploiement de binaires sur les postes clients en utilisant un Node.JS embarqué (PKG), communiquant avec un site web au travers de Chrome Native Messaging.\n","authors":[{"name":"Matthieu Kern","url":"http://twitter.com/MatthieuKern","avatar":"https://api.microlink.io/?url=https://twitter.com/MatthieuKern&amps;embed=image.url"},{"name":"Quentin Ménoret","url":"http://twitter.com/QuentinMenoret","avatar":"https://api.microlink.io/?url=https://twitter.com/QuentinMenoret&amps;embed=image.url"}],"slides":["https://fr.slideshare.net/MatthieuKern1/how-to-connect-1980-and-2018"],"links":[],"videos":["https://youtu.be/K-zHEcSPwi4?t=11m"]},{"title":"Yarn: Hier, Aujourd'hui, et Demain","extract":"Cela fait maintenant deux ans que Yarn fait parti du paysage Javascript, et s'est installé dans les deux principaux gestionnaires de paquets avec npm.\n\nPorté par un core maintainer de Yarn, ce talk a pour but de faire une retrospective sur cette période, revenir sur les principales fonctionnalités qui restent son apanage, et offrir un aperçu des avancées à venir.\n","authors":[{"name":"Maël Nison","url":"https://twitter.com/arcanis","avatar":"https://api.microlink.io/?url=https://twitter.com/arcanis&amps;embed=image.url"}],"slides":[],"links":["https://yarnpkg.com"],"videos":["https://youtu.be/K-zHEcSPwi4?t=38m"]},{"title":"Serveur-client GraphQL via Apollo","extract":"La révolution est en marche, GraphQL devient de plus en plus populaire. Mais c'est quoi ?\nGraphQL est un manifeste Facebook, qui met en place un language de query permettant de créer des APIs facilement, pouvant communiquer avec n'importe qu'elle source de données.\n\nLe talk permet de mettre en place un serveur GraphQL, avec un client React en utilisant la librairie Apollo.\n","authors":[{"name":"Jonathan","url":"http://twitter.com/captainjojo42","avatar":"https://api.microlink.io/?url=https://twitter.com/captainjojo42&amps;embed=image.url"}],"slides":["https://fr.slideshare.net/jonathanjalouzot/graphql-with-apollojs"],"links":["https://github.com/duck-invaders/graphql-apollo"],"videos":["https://youtu.be/K-zHEcSPwi4?t=1h14m"]}],"body":{"t":"div"}}