{"filename":"2019-11-27.md","date":"2019-11-27","title":"meetups/2019-11-27.md","edition":"89","host":"Alan","sponsors":[],"meetupLink":"https://www.meetup.com/Paris-js/events/266104891/","talks":[{"title":"Développer des structures de données en JavaScript","extract":"There is a tenacious misconception nowadays that people working with JavaScript do not need to know much about data structures because developing for the web is still often deemed to be, and this cannot be more false, an easier task than \"real\" programming.\n\nWeb applications have become complex beasts and node.js allows to build programs that used to be other backend languages' turf. JavaScript developers now need to develop, as with any other programming language, custom data structures to solve particular problems when arrays and objects are simply not enough. The intention of this presentation is therefore to compile series of tips, tricks and use cases regarding the implementation of data structures in JavaScript and the challenges it poses. It is indeed tricky to ensure consistent performance in a high-level language with JIT and where engines like v8 apply a lot of optimization magic. One has to be able to evolve around those constraints. Examples will be taken from libraries such as graphology, sigma.js' newest version and finally mnemonist to demonstrate that 1. performant data structures can be designed for JavaScript using the language's capabilities and that 2. everyone can use them to solve problems more efficiently.\n","authors":[{"name":"Guillaume Plique","url":"https://twitter.com/Yomguithereal","avatar":"https://api.microlink.io/?url=https://twitter.com/Yomguithereal&amps;embed=image.url"}],"slides":["https://yomguithereal.github.io/mnemonist/presentations/fosdem2019/#0"],"videos":["https://www.youtube.com/watch?v=2-_HaPjEIdY"]},{"title":"Mise à l’échelle d’une application web","extract":"\"Il me faut un mois de refacto avant de commencer le dev…”, \"C’est bon, je finis au prochain sprint\" (dit pareil depuis 3 mois), \"C’est du code legacy, ça\" (fait au sprint dernier). Je suis sur que vous avez déjà entendu ça quelque part... Dans cette présentation, je décris le niveau de qualité dans notre web app AngularJS qui n'a pas grossi très sereinement. Des événements, des références d'objets javascript, des scopes de composants, des états dans des services angular, etc.\nComment s'est-on réveillé de ce cauchemard ? Vous verrez comment Redux a stabilisé la gestion de l'état applicatif, React a introduit un meilleur design orienté composant et amélioré la performance et enfin, comment RxJS a découplé le cycle de vie des composants de celui des données !\n","authors":[{"name":"Eric Le Merdy","url":"https://twitter.com/ericlemerdy","avatar":"https://api.microlink.io/?url=https://twitter.com/ericlemerdy&amps;embed=image.url"}],"links":["https://one2team.com/"],"videos":["https://www.youtube.com/watch?v=VsKSvogE8pE"]},{"title":"Smooth animations that load fast, with Lottie and Webpack","extract":"How to build a Webpack loader to handle Lottie animation files\n","authors":[{"name":"Antoine Jackson"}],"videos":["https://www.youtube.com/watch?v=JroVlfOYrUU"]}],"body":{"t":"div"}}