{"filename":"2019-01-30.md","date":"2019-01-30","title":"meetups/2019-01-30.md","edition":"81","host":"Abbeal","sponsors":[],"meetupLink":"https://www.meetup.com/Paris-js/events/257027880/","talks":[{"title":"React JS / GraphQL expliqués aux développeurs Back-End (Symfony, Node.js...)","extract":"Etant développeur Back-End (Symfony / Node.js) et connaissant l'API Rest, il s'agit de vous apporter des éclairages sur la librairie React JS et sur le langage de requêtes GraphQL.\nA travers de l'exposé seront développées toutes les facettes de ces outils.\n","authors":[{"name":"Christophe","url":null,"avatar":null}],"slides":["https://github.com/parisjs/talks/files/2809486/GraphQL._.React.Js.Explique.aux.devs.backend.pdf"],"links":[],"videos":["https://youtu.be/heXd9HL9O8s?t=376"]},{"title":"Integrating AWS Secrets Manager with Kubernetes using Node.js","extract":"During the past six months I have proudly been working on \"Kubernetes external secrets\".\nThe project, initially developed internally at GoDaddy, is now open source under MIT license on the company public Github.\nKubernetes external secrets is entirely written in Node.js and it integrates external provides such as AWS Secrets Manager with Kubernetes for securely storing secrets.\nThe project extends the Kubernetes API by adding an ExternalSecret object using Custom Resource Definition and a controller to implement the behavior of the object itself.\nAn ExternalSecret declares how to fetch the secret data (e.g., fetch property foo from AWS Secrets Manager), while the controller converts all ExternalSecrets to Secrets.\nThe conversion is completely transparent to Pods that can access Secrets normally (e.g., via a volume mount).\nAs maintainer, and principal contributor, with this talk I want to present the project and run a demo that practically explains how the system works.\nTrust me, you are going to love it!\n","authors":[{"name":"Jacopo Daeli","url":"http://www.jacopodaeli.com","avatar":"https://api.microlink.io/?url=https://twitter.com/JacopoDaeli&amps;embed=image.url"}],"slides":["https://docs.google.com/presentation/d/17hJzgcRqke4gXjKQIF_U8tyR-ssBgi593ZqVKUBVB2M/edit#slide=id.g4e7fa82987_0_58"],"links":["https://github.com/godaddy/kubernetes-external-secrets"],"videos":["https://youtu.be/heXd9HL9O8s?t=1929"]},{"title":"Code Prettier Code","extract":"L'objectif de ce talk est de montrer comment et pourquoi convaincre une équipe d'ajouter Prettier à ses projets js/ts dans le court terme. J'y démontre la valeur ajoutée de Prettier, et comment l'installer de bout en bout: comment l'ajouter au projet, l'intégrer aux linters existants, organiser la PR qui appliquera Prettier, merger facilement les branches des autres membres de l'équipe, et les meilleurs moyens de faire en sorte d'appliquer Prettier sur tous les changements futurs.\n\nL'objectif est vraiment de montrer à qui serait intéressé par Prettier, que la complexité de son ajout dans un projet, même gros, est assez réduite pour considérer de le faire sans trop attendre, et que sa valeur ajoutée en vaut le prix.\n","authors":[{"name":"Théo","url":null,"avatar":null}],"slides":["https://docs.google.com/presentation/d/1Y7QM9teTVlzu9QhcbNYTTaPBkhUbeQOed0d25fo5cL8/edit?usp=sharing"],"links":["https://github.com/teogeos/prettier-demo"],"videos":["https://youtu.be/heXd9HL9O8s?t=3600"]}],"body":{"t":"div"}}