{"filename":"2020-01-29.md","date":"2020-01-29","title":"meetups/2020-01-29.md","edition":"91","host":"MeilleursAgents","sponsors":[],"meetupLink":"https://www.meetup.com/Paris-js/events/267905446/","talks":[{"title":"Chrome Dev Tools Tips","extract":"Lassé de devoir attendre plus de 10 minutes la fin d'un build qui ne faisait que tester ma codebase, j'ai décidé d'améliorer la CI de mon projet Web. J'ai divisé le temps de CI par 2, et en bonus j'ai automatisé des tâches fastidieuses et répétitives pour mon équipe sans rallonger le build.\nDurant ce talk, je vous présenterai la recette pour une CI intelligente et efficace :\n- les workflows CircleCI pour paralléliser vos tâches\n- l'automatisation du déploiement et de la publication de librairies\n- l'ajout d'outils externes comme Danger et BundleSize pour monitorer la santé de votre codebase\nCette recette a déjà pu aider plusieurs équipes en interne. Vous pourrez l'appliquer à votre projet, et vos collègues seront ravis des changements que vous pourrez apporter à votre CI!\n","authors":[{"name":"Vincent Vallet","url":"https://twitter.com/Vince_Vallet","avatar":"https://api.microlink.io/?url=https://twitter.com/Vince_Vallet&amps;embed=image.url"}],"videos":["https://www.youtube.com/watch?v=WrJw3Is_-Cs"]},{"title":"Faites bien plus que des tests avec votre CI tout en la maintenant sous les 5 minutes","extract":"On connait tous chrome dev tools, depuis des années ça nous permet d'inspecter le DOM et de mesurer les temps de réponses.\nMais cet outils regorge de fonctionnalités parfois un peu cachées.\nEt si on tentait de les déterrer et d'expliquer pourquoi certaines sont juste incroyables.\nLes performances et leur analyse ne sont plus une options mais une nécessité.\n","authors":[{"name":"Aurélien Le Masson","url":"https://twitter.com/aurelien__lm","avatar":"https://api.microlink.io/?url=https://twitter.com/aurelien__lm&amps;embed=image.url"}],"videos":["https://www.youtube.com/watch?v=WwzXePktNxs"],"slides":["https://drive.google.com/file/d/10pTySBun0SvRP8zvM5Ms6D5JDR5mO6CY/view?usp=sharing"]},{"title":"CodePush: Deploiement d'application de A à Z","extract":"Description et retours d'experience sur CodePush de Microsoft.\n- Mise en place\n- Deploiement d'application et de mise à jour\n- Avantages / Inconvenient\n","authors":[{"name":"Thomas Dubois","url":"https://twitter.com/ThoDubois","avatar":"https://api.microlink.io/?url=https://twitter.com/ThoDubois&amps;embed=image.url"}],"videos":["https://www.youtube.com/watch?v=oAoQhBAThzw"]}],"body":{"t":"div"}}