{"filename":"2020-02-26.md","date":"2020-02-26","title":"meetups/2020-02-26.md","edition":"92","host":"Aircall","sponsors":[],"meetupLink":"https://www.meetup.com/Paris-js/events/268482228/","talks":[{"title":"Implementing complex design systems in your front-end","extract":"As companies work on features and evolve their product, design systems become increasingly used and front-end engineers find themselves working with atomic components more and more. Our goal is to make our front-end components into our single source of truth, instead of the sketch files, and we'd like to share a few thoughts on how we're going about it.\n","authors":[{"name":"Andrey Soloviev","url":"https://twitter.com/MindRave","avatar":"https://api.microlink.io/?url=https://twitter.com/MindRave&amps;embed=image.url"}],"videos":null},{"title":"Real-world ReasonReact","extract":"Un live coding présentant comment on développe une web app avec ReasonReact. Approche de divers sujets tels que les Future, les types Result, les reducerComponents, les souscriptions et le routing.\n","authors":[{"name":"Matthias Le Brun","url":"https://twitter.com/bloodyowl","avatar":"https://api.microlink.io/?url=https://twitter.com/bloodyowl&amps;embed=image.url"}],"videos":null,"slides":null},{"title":"Server-side rendering, Twig, Vue, un ménage à 3 qui n'a pas fonctionné ","extract":"Il y a 6 mois, j'ai rejoint le projet d'une plate-forme e-commerce: Tarkett, multinationale française spécialisée dans le revêtement de sols.\n\nInitialement développé en Symfony, le site s'est progressivement orienté sur une solution hybride Symfony/Vue.js afin de rendre dynamiques certaines parties du site.\n\nJe vous propose de voir ensemble comment la migration vers Nuxt.js nous a permis de diviser par 4 la métrique Visually Complete.\n\nJe vous présenterai :\n\nPourquoi l'architecture initiale Symfony/Vue n'était pas optimale.\nPourquoi et comment nous avons essayé de recoder Nuxt, sans succès...\nComment effectuer une migration progressive d'un site Twig/Vue vers une solution 100% Nuxt.\nUne comparaison des différentes solutions techniques sous l'angle du Speed Index.\nEn sortant, le public saura comment ajouter Vue/Nuxt sur un projet Symfony et repartira avec tous les tips pour réussir une migration progressive.\n","authors":[{"name":"Cyril"}]},{"title":"Au-delà de la pagination : rendre vos tableaux React performants grâce au windowing","extract":"Si vous avez déjà essayé d'afficher un tableau contenant beaucoup d'éléments en React, vous savez probablement que cela peut très vite dégrader les performances de votre site. Nous allons aborder les techniques suivantes pour améliorer les performances :\n\nUne solution simple : la pagination\nPrivilégier l'UX : Le lazy loading et ses pièges\nLe windowing : le meilleur des deux mondes ?\nDans ce talk, je souhaite vous donner les clés pour construire des tableaux performants du premier coup.\n","authors":[{"name":"Elie","url":"https://twitter.com/elie_dutheil","avatar":"https://api.microlink.io/?url=https://twitter.com/elie_dutheil&amps;embed=image.url"}]}],"body":{"t":"div"}}