{"previousPageIsFirst":true,"previous":"MjAyMC0wMi0yNg==","next":"MjAxOC0wOC0zMA==","list":[{"id":"2019-11-27","filename":"2019-11-27.md","date":"2019-11-27","title":"meetups/2019-11-27.md","edition":"89","host":"Alan","sponsors":[],"meetupLink":"https://www.meetup.com/Paris-js/events/266104891/","talks":[{"title":"Développer des structures de données en JavaScript","extract":"There is a tenacious misconception nowadays that people working with JavaScript do not need to know much about data structures because developing for the web is still often deemed to be, and this cannot be more false, an easier task than \"real\" programming.\n\nWeb applications have become complex beasts and node.js allows to build programs that used to be other backend languages' turf. JavaScript developers now need to develop, as with any other programming language, custom data structures to solve particular problems when arrays and objects are simply not enough. The intention of this presentation is therefore to compile series of tips, tricks and use cases regarding the implementation of data structures in JavaScript and the challenges it poses. It is indeed tricky to ensure consistent performance in a high-level language with JIT and where engines like v8 apply a lot of optimization magic. One has to be able to evolve around those constraints. Examples will be taken from libraries such as graphology, sigma.js' newest version and finally mnemonist to demonstrate that 1. performant data structures can be designed for JavaScript using the language's capabilities and that 2. everyone can use them to solve problems more efficiently.\n","authors":[{"name":"Guillaume Plique","url":"https://twitter.com/Yomguithereal","avatar":"https://api.microlink.io/?url=https://twitter.com/Yomguithereal&amps;embed=image.url"}],"slides":["https://yomguithereal.github.io/mnemonist/presentations/fosdem2019/#0"],"videos":["https://www.youtube.com/watch?v=2-_HaPjEIdY"]},{"title":"Mise à l’échelle d’une application web","extract":"\"Il me faut un mois de refacto avant de commencer le dev…”, \"C’est bon, je finis au prochain sprint\" (dit pareil depuis 3 mois), \"C’est du code legacy, ça\" (fait au sprint dernier). Je suis sur que vous avez déjà entendu ça quelque part... Dans cette présentation, je décris le niveau de qualité dans notre web app AngularJS qui n'a pas grossi très sereinement. Des événements, des références d'objets javascript, des scopes de composants, des états dans des services angular, etc.\nComment s'est-on réveillé de ce cauchemard ? Vous verrez comment Redux a stabilisé la gestion de l'état applicatif, React a introduit un meilleur design orienté composant et amélioré la performance et enfin, comment RxJS a découplé le cycle de vie des composants de celui des données !\n","authors":[{"name":"Eric Le Merdy","url":"https://twitter.com/ericlemerdy","avatar":"https://api.microlink.io/?url=https://twitter.com/ericlemerdy&amps;embed=image.url"}],"links":["https://one2team.com/"],"videos":["https://www.youtube.com/watch?v=VsKSvogE8pE"]},{"title":"Smooth animations that load fast, with Lottie and Webpack","extract":"How to build a Webpack loader to handle Lottie animation files\n","authors":[{"name":"Antoine Jackson"}],"videos":["https://www.youtube.com/watch?v=JroVlfOYrUU"]}]},{"id":"2019-10-30","filename":"2019-10-30.md","date":"2019-10-30","title":"meetups/2019-10-30.md","edition":"88","host":"Datadog","sponsors":[],"meetupLink":"https://www.meetup.com/Paris-js/events/264722007/","talks":[{"title":"Tour d'horizon de Yarn 2!","extract":"Introduit il y a bientôt trois ans, Yarn s'est depuis lors taillé une solide place dans l'écosystème JavaScript grâce à sa mise au premier plan des problèmes de stabilité et de consistance. Il est maintenant temps de découvrir ce que Yarn 2 nous réserve, et vous dévoiler les prochaines étapes de notre plan visant à rendre vos applications plus stables, et vos cycles de développement plus abordables.\n","authors":[{"name":"Maël Nison","url":"https://twitter.com/arcanis","avatar":"https://api.microlink.io/?url=https://twitter.com/arcanis&amps;embed=image.url"}],"links":["https://github.com/yarnpkg/berry"],"videos":["https://youtu.be/U8eV3XGInRU"]},{"title":"Property based testing : de la théorie à la pratique","extract":"Apparu dans le monde fonctionnel avec QuickCheck, le property based testing est une nouvelle approche pour tester le bon fonctionnement d'une application.\nIl permet de détecter des bugs en quelques lignes sans avoir à spécifier l'ensemble des cas limites et s'avère être un allié puissant aux tests unitaires classiques.\nNous verrons ensemble ce qu'est le property based testing.\nPar la suite nous déroulerons plusieurs exemples d'application, basés sur le framework fast-check, allant du simple algorithme à l'interface graphique.\n","authors":[{"name":"Nicolas Dubien","url":"https://twitter.com/ndubien","avatar":"https://api.microlink.io/?url=https://twitter.com/ndubien&amps;embed=image.url"}],"slides":["https://dubzzz.github.io/fast-check.github.com/talks/meetup-typescript-04092018/property-based-testing.html"],"links":["https://github.com/dubzzz/fast-check/"],"videos":["https://youtu.be/lOnb50OpIec"]},{"title":"Un voyage de deux ans au coeur d’une application JS fullstack","extract":"En 2017, je commençais mon premier projet en tant que lead tech. A cette époque, je faisais mes premiers pas en react-native et j'étais accompagné de deux développeurs. Notre objectif: construire un POC en 4 semaines pour démontrer que nous pouvions déverrouiller une voiture à l’aide d’une application mobile codée en react-native.\n\nEn deux ans, cette équipe a fait beaucoup de chemin. Le POC est maintenant devenu une application complète permettant de visualiser la disponibilité de centaines de voitures dans Paris, elle est devenu le métier principal de notre client et l’équipe est maintenant composé de 10 développeurs. Cependant, cette évolution s'est accompagnée de nombreux défis: Des bugs, de la dette technique, des bugs, des ralentissements de l’équipe, des mauvaises conceptions architecturales faites par votre serviteur et ah oui, des bugs.\n\nNous avons appris beaucoup alors que nous cherchions à relever ces défis et j’aimerais partager nos apprentissages.\nVoici quelques sujets don’t nous parlerons pendant cette session :\n\nMonitorer les bugs sur une fullstack JS\nTyper le JS\nIndustrialiser: Marque blanche && intégration continue && déploiements automatisés de toute la stack\nTester fonctionnellement une application en react-native\n","authors":[{"name":"Maxime Sraiki","url":"https://twitter.com/MaximeSraiki","avatar":"https://api.microlink.io/?url=https://twitter.com/MaximeSraiki&amps;embed=image.url"}],"videos":["https://youtu.be/5Nzuyu0u6T4"]},{"title":"How to refactor your API without bugs using GraphQL and static type-checking","extract":"Is this field still used? Can I safely delete it? When refactoring an API, that's a question you can ask yourself. In this talk, I will show how Relay and static typing can help you refactor your GraphQL API quickly and without introducing defects.\n","authors":[{"name":"Bastien Duret","url":"https://twitter.com/bast0che","avatar":"https://api.microlink.io/?url=https://twitter.com/bast0che&amps;embed=image.url"}],"videos":["https://youtu.be/AzM1i8-hc2w"]}]},{"id":"2019-09-25","filename":"2019-09-25.md","date":"2019-09-25","title":"meetups/2019-09-25.md","edition":"87","host":"Doctrine","sponsors":[],"meetupLink":"https://www.meetup.com/Paris-js/events/264776672/","talks":[{"title":"Comment j'ai fait décoller mon projet perso : une app web et desktop cross-platform","extract":"Je vous propose un REX de mon principal projet perso depuis 3 ans. C'est une application web et desktop compagnon du simulateur de vol X-Plane.\nComment on fait pour coder une app web + desktop cross-platform ? Comment on la met en prod, comment on la met à jour, comment on la sécurise ?\n\nEt aussi, on va piloter des avions.\n","authors":[{"name":"Foucauld Degeorges","url":"https://twitter.com/foucdeg","avatar":"https://api.microlink.io/?url=https://twitter.com/foucdeg&amps;embed=image.url"}],"slides":["https://slides.com/foucaulddegeorges/electron"],"videos":["https://youtu.be/a4F-exp90ZQ"]},{"title":"CSS, préprocesseurs, BEM, CSS Modules, Styled Components... comment choisir ?","extract":"\"L'environnement CSS a bien évolué au fur et à mesure de ces 20 dernières années. Cependant, il semble toujours difficile d'écrire du CSS fonctionnel et maintenable : en 2019, que choisir pour son projet afin d'y arriver ? Avec un processus qui se veut le plus objectif possible, nous établirons une checklist de ce qu'est une bonne stack CSS afin de choisir les technos qui vous conviendront le mieux.\"\n","authors":[{"name":"Albéric Trancart","url":"https://twitter.com/alberictrancart","avatar":"https://api.microlink.io/?url=https://twitter.com/alberictrancart&amps;embed=image.url"}],"videos":["https://youtu.be/3ztP8ujDkhI"]},{"title":"La conversion de type en JavaScript","extract":"Est-ce que tout est objet en JavaScript ?\nVaut-il vraiment mieux utiliser === plutôt que == ? Pourquoi ?\nPourquoi [] + [] donne une chaîne vide ?\nPourquoi [] + {} ne donne pas la même chose que {} + []?\nQuand a lieu la conversion de type en JavaScript ?\nEst-ce qu'elle est logique ou est-ce que c'est le mal ?\nVenez dédiaboliser la conversion de type en JavaScript lors de ce talk !\n","authors":[{"name":"Stanislas Ormières","url":"https://twitter.com/laruiss","avatar":"https://api.microlink.io/?url=https://twitter.com/laruiss&amps;embed=image.url"}],"slides":["https://slides.com/stormier/type-coercion-in-js"],"videos":["https://youtu.be/DNwZGdkAI58"]}]},{"id":"2019-06-26","filename":"2019-06-26.md","date":"2019-06-26","title":"meetups/2019-06-26.md","edition":"86","host":"Dailymotion","sponsors":[],"meetupLink":"https://www.meetup.com/Paris-js/events/260336640/","talks":[{"title":"WebAssembly va tuer JS (ou pas)","extract":"Bon, WebAssembly, c’est le nouveau cool kid du quartier. Combien de fois on a entendu des collègues balancer un “nan mais bientôt avec WebAssembly on aura plus à subir JS”.\nMais est-ce bien vrai ? WebAssembly (WASM de son petit nom) va-t-il mettre fin à plusieurs décennies de règne sans partage de JS sur les browsers ?\nMais d’ailleurs, c’est quoi WASM ?\nQuel est le rapport avec Rust ?\nEt avec TypeScript ?\nQui est le Chevalier Blanc ?\nQui a volé l’orange du marchand ?\n\nOn répondra à certaines de ces questions… mais lesquelles ?\n","authors":[{"name":"Vladimir de Turckheim","url":"https://twitter.com/poledesfetes","avatar":"https://api.microlink.io/?url=https://twitter.com/poledesfetes&amps;embed=image.url"}],"videos":["https://youtu.be/-hQw-tbIQ-E"]},{"title":"Utiliser WebAssembly, dès aujourd'hui","extract":"On commence à entendre parler de plus en plus de WebAssembly. Dans tous les talks, on nous présente des benchmarks, des diagrammes ... on nous explique la théorie ...  \n\nMais où est le code ? Comment peut-on jouer avec concrètement ?  \n\nC'est le challenge que je me suis proposé de résoudre avec topheman/rust-wasm-experiments.  \n\nJe vous propose de vous montrer un exemple concret d'utilisation de WebAssembly avec Rust.\n","authors":[{"name":"Christophe Rosset","url":"https://twitter.com/topheman","avatar":"https://api.microlink.io/?url=https://twitter.com/topheman&amps;embed=image.url"}],"videos":["https://youtu.be/F3wOfWIFzVc"],"links":["https://github.com/topheman/rust-wasm-experiments"]},{"title":"WebAssembly: post MVP features and goals","extract":"","authors":[{"name":"Elia Maino","url":"https://twitter.com/eliamain","avatar":"https://api.microlink.io/?url=https://twitter.com/eliamain&amps;embed=image.url"}],"videos":["https://youtu.be/nOG0lHpRxQ8"]}]},{"id":"2019-05-29","filename":"2019-05-29.md","date":"2019-05-29","title":"meetups/2019-05-29.md","edition":"85","host":"Payfit","sponsors":[],"meetupLink":"https://www.meetup.com/Paris-js/events/260336623/","talks":[{"title":"React Hooks & React Context","extract":"Ce talk présente le fonctionnement de React Hooks & React Context : quels sont leurs apports et comment en tirer parti dans la mise en place d'un state global, afin de se passer de solutions externes comme Redux.\n","authors":[{"name":"Grégory Bellencontre","url":null,"avatar":null}],"videos":["https://youtu.be/ZU1fbYvLB9U"]},{"title":"React-Native Getting started","extract":"Présentation de React-Native, par où commencer?\nQu'est ce qu'Expo?\nLive Coding : Getting started expo app and native app\nWhat's next?\n","authors":[{"name":"Thomas Dubois","url":"https://twitter.com/thodubois","avatar":"https://api.microlink.io/?url=https://twitter.com/thodubois&amps;embed=image.url"}],"slides":["https://slides.com/fromwood/deck"],"videos":["https://youtu.be/T36WVwiVqhw"]},{"title":"Animations : comment atteindre rapidement le standard du marché, et au delà","extract":"Retour d'expérience sur plusieurs mois d'apprentissages sur les animations en React Native. Quelles sont les clés pour proposer une expérience fluide et cohérente ? Comment fait-on cela techniquement de la plus rapide façon ? Nous allons partir d'animations simples et peu visibles, mais qui, quand elles ne sont pas présentes, font taches. Et nous finirons par des animations plus complexes et \"wahou\" !\n","authors":[{"name":"Louis Lagrange","url":"https://twitter.com/Minishlink","avatar":"https://api.microlink.io/?url=https://twitter.com/Minishlink&amps;embed=image.url"}],"videos":["https://youtu.be/StGBIJzwEis"]}]},{"id":"2019-04-24","filename":"2019-04-24.md","date":"2019-04-24","title":"meetups/2019-04-24.md","edition":"84","host":"Daveo","sponsors":[],"meetupLink":"https://www.meetup.com/fr-FR/Paris-js/events/260336485/","talks":[{"title":"Modifier votre codebase à l’aide de codemods","extract":"L'idée de changer un composant qui est utilisé dans quatre cent fichiers de votre codebase vous angoisse ? Certains cas sont trop complexes pour des regex (et de toute façon, qui sait écrire une regex ?) Vous n'êtes pas des machines. Ça tombe bien, votre PC l'est ! Lors de cette talk, je vais présenter jscodeshift, un outil en CLI permettant d'écrire des transformations de code en manipulant un AST.\n","authors":[{"name":"Augustin Le Fèvre ","url":"https://twitter.com/gusguslf","avatar":"https://api.microlink.io/?url=https://twitter.com/gusguslf&amps;embed=image.url"}],"slides":["https://talk-codemods-paris-js.augustinlf.now.sh/."],"links":["https://github.com/AugustinLF/talk-codemods-paris-js","https://github.com/facebook/jscodeshift"],"videos":["https://www.youtube.com/watch?v=sWN7b4g_HMg"]},{"title":"Elm: beginners and production compliant","extract":"Ce talk présente le langage Elm en mettant en valeur sa simplicité de prise en main pour les débutants, la fiabilité des applications écrites en Elm.\nLive coding included !\nCe talk n'a pas pour vocation à apprendre le langage, mais plutôt montrer son potentiel.\n","authors":[{"name":"Sébastien Besnier","url":null,"avatar":null}],"slides":["https://slides.com/sebbes/deck"],"links":["https://elm-lang.org/"],"videos":["https://www.youtube.com/watch?v=kLumTtZ8awI"]},{"title":"Abstract Components","extract":"Capture ideas in a more efficient ways with your abstractions by incorporating a tiered way of thinking. By making sure each level exposes the underlying levels of customisation, and making sure the current level is overridable, you're ensuring your ideas you incorporated in an abstraction continue to exist, even with customisation.\n","authors":[{"name":"Haroen Viaene","url":"https://twitter.com/haroenv","avatar":"https://api.microlink.io/?url=https://twitter.com/haroenv&amps;embed=image.url"}],"slides":["https://haroen.me/presentations/en/abstract-components/"],"links":[],"videos":["https://www.youtube.com/watch?v=462dXFuUg5o"]}]},{"id":"2019-03-27","filename":"2019-03-27.md","date":"2019-03-27","title":"meetups/2019-03-27.md","edition":"83","host":"Toucan Toco","sponsors":[],"meetupLink":"https://www.meetup.com/fr-FR/Paris-js/events/258319504/","talks":[{"title":"Tester n’importe quel code, même le code dont vous n’êtes pas fier!","extract":"Une approche pragmatique au test de code legacy (code dont on pense qu’il n’est pas testable et que personne veut toucher).\nEn utilisant des mock simples et des design patterns, en javascript.\n\nAvez vous déjà entendu quelque chose comme:\n\n“C’est pas grave, on teste pas ce code là.”\n“T’es sûr de vouloir toucher ce code? Tu risque de casser quelque chose!”\n\nÇa a un air de déjà vu, n’est-ce pas?\nLa pluspart du temps en plus, les deux situations parlent du même code.\n\nLa majorité du code a une date d’expiration, plus ou moins dans le futur.\nCe talk est là pour vous aider lorsque cette date a été dépassée.\nMême dans le cas où cette date a été dépassée pour si longtemps que le code est devenu ce monstre de spaghetti moisi qui sent tellement mauvais que vous en avez peur et que tout ce que vous voulez c’est le jeter à la poubelle (mais vous en avez trop peur).\n\nCe talk va vous aider à éviter de “casser quelque chose” et “make your code great again”.\nVous allez même pouvoir aider les futurs aventuriers qui s’égareront dans ce code: le code que vous écrivez aujourdhui est le code légacy de demain.\nEs-ce que vous voulez faire encore plus le bazar?\nOu es-ce que vous voulez avoir du code plus robuste qui aidera les générations futures?\n","authors":[{"name":"William Gorge","url":"https://twitter.com/wgorgedev","avatar":"https://api.microlink.io/?url=https://twitter.com/wgorgedev&amps;embed=image.url"}],"slides":["https://docs.google.com/presentation/d/1B6zk3VjbsveVcDgq5mKJ1EP2buhBk9auDVh77jQPLsU/edit#slide=id.p"],"links":[],"videos":["https://youtu.be/zUeMu73Md9k?t=600"]},{"title":"The Challenging Migration from Heroku to Google Kubernetes Engine","extract":"L'été dernier, on a migré une application Node.js distribuée, de Heroku vers Google Kubernetes Engine. Je pensais que ça allait être facile. Hé bien j'avais tort ! sweat_smile\nJe vais vous raconter les ratés les plus épiques auxquels j'ai du faire face pendant cette migration. Et si vous êtes sympas, je vous expliquerai les astuces que j'ai appliquées pour corriger le tir !\n","authors":[{"name":"Adrien Joly","url":"http://twitter.com/adrienjoly","avatar":"https://api.microlink.io/?url=https://twitter.com/adrienjoly&amps;embed=image.url"}],"slides":["https://docs.google.com/presentation/d/1eVk1Px99bk-5BGKYL3MjZuQQqRezHVwtPiGFynBtsyE/edit?usp=sharing"],"links":["https://blog.algolia.com/challenging-migration-heroku-google-kubernetes-engine/"],"videos":["https://youtu.be/zUeMu73Md9k?t=2494"]},{"title":"From Heroku / Github / CircleCI to Kubernetes (helm/vault) / Gitlab CI CD","extract":"Rex sur la migration d'une société de Heroku (app engine GCP like), Github et CircleCI en Saas vers Kubernetes (via Helm et Vault), et gitlab (avec gitlab-ci) pour la CI/CD.\n","authors":[{"name":"Jérémy Wimsingues","url":"https://twitter.com/JWimsingues","avatar":"https://api.microlink.io/?url=https://twitter.com/JWimsingues&amps;embed=image.url"}],"slides":["https://docs.google.com/presentation/d/1Sy-4T-Nj4tyj07FeQhUIFNsFOtu9vlWnXXQt4RKVHSY/edit?usp=sharing"],"links":[],"videos":["https://youtu.be/zUeMu73Md9k?t=3837"]}]},{"id":"2019-02-27","filename":"2019-02-27.md","date":"2019-02-27","title":"meetups/2019-02-27.md","edition":"82","host":"BAM","sponsors":[],"meetupLink":"https://www.meetup.com/fr-FR/Paris-js/events/257184550/","talks":[{"title":"Debugging a Non Reproducible Bug with 20k production crashes","extract":"20 000 crashes en production. Un bug impossible à reproduire. Un cauchemar quoi !\nLaissez-moi vous raconter une glorieuse histoire de debugging, pleine de rebondissements et d'apprentissages.\nJ'ai aussi publié un article dessus qui a buzzé sur Reddit (~2000 upvotes), j'espère que ça intéressera tout autant le public de Paris.JS !\n","authors":[{"name":"Alexandre Moureaux","url":"https://twitter.com/almouro","avatar":"https://api.microlink.io/?url=https://twitter.com/almouro&amps;embed=image.url"}],"slides":["https://slides.com/alexandremoureaux/debugging-a-non-reproducible-crash#/"],"links":["https://blog.bam.tech/developper-news/debugging-a-non-reproducible-crash"],"videos":["https://www.youtube.com/watch?v=jT9uyoyBZas&list=PL4dDsXV05YbtY5MGy_uOM0B7ZLiKrFUfY"]},{"title":"Front-end architecture in practice","extract":"Le terme d'architecture est désormais plus que pertinent coté front-end.\nAprès une courte introduction sur les 3 révolutions du web, nous verrons comment appliquer simplement des notions d'architecture pour mettre en place une roadmap et une guideline sur votre projet.\n","authors":[{"name":"Charly Poly","url":"https://twitter.com/whereischarly","avatar":"https://api.microlink.io/?url=https://twitter.com/whereischarly&amps;embed=image.url"}],"slides":["https://slides.com/charlypoly-1/deck-9"],"links":[],"videos":["https://www.youtube.com/watch?v=sK8JCZtiNxc&t=0s&list=PL4dDsXV05YbtY5MGy_uOM0B7ZLiKrFUfY"]},{"title":"Good practices","extract":"Un passage en revue des \"bonnes pratiques\", ces règles établies qu'on ne questionne plus trop.\nSeparation of concerns, DRY, TDD, REST, type systems, est-ce que toutes ces pratiques sont encore valables?\n","authors":[{"name":"Matthias Le Brun","url":"https://twitter.com/bloodyowl","avatar":"https://api.microlink.io/?url=https://twitter.com/bloodyowl&amps;embed=image.url"}],"slides":["https://speakerdeck.com/bloodyowl/best-practices"],"links":[],"videos":["https://www.youtube.com/watch?v=4CEuGG892UU&list=PL4dDsXV05YbtY5MGy_uOM0B7ZLiKrFUfY"]}]},{"id":"2019-01-30","filename":"2019-01-30.md","date":"2019-01-30","title":"meetups/2019-01-30.md","edition":"81","host":"Abbeal","sponsors":[],"meetupLink":"https://www.meetup.com/Paris-js/events/257027880/","talks":[{"title":"React JS / GraphQL expliqués aux développeurs Back-End (Symfony, Node.js...)","extract":"Etant développeur Back-End (Symfony / Node.js) et connaissant l'API Rest, il s'agit de vous apporter des éclairages sur la librairie React JS et sur le langage de requêtes GraphQL.\nA travers de l'exposé seront développées toutes les facettes de ces outils.\n","authors":[{"name":"Christophe","url":null,"avatar":null}],"slides":["https://github.com/parisjs/talks/files/2809486/GraphQL._.React.Js.Explique.aux.devs.backend.pdf"],"links":[],"videos":["https://youtu.be/heXd9HL9O8s?t=376"]},{"title":"Integrating AWS Secrets Manager with Kubernetes using Node.js","extract":"During the past six months I have proudly been working on \"Kubernetes external secrets\".\nThe project, initially developed internally at GoDaddy, is now open source under MIT license on the company public Github.\nKubernetes external secrets is entirely written in Node.js and it integrates external provides such as AWS Secrets Manager with Kubernetes for securely storing secrets.\nThe project extends the Kubernetes API by adding an ExternalSecret object using Custom Resource Definition and a controller to implement the behavior of the object itself.\nAn ExternalSecret declares how to fetch the secret data (e.g., fetch property foo from AWS Secrets Manager), while the controller converts all ExternalSecrets to Secrets.\nThe conversion is completely transparent to Pods that can access Secrets normally (e.g., via a volume mount).\nAs maintainer, and principal contributor, with this talk I want to present the project and run a demo that practically explains how the system works.\nTrust me, you are going to love it!\n","authors":[{"name":"Jacopo Daeli","url":"http://www.jacopodaeli.com","avatar":"https://api.microlink.io/?url=https://twitter.com/JacopoDaeli&amps;embed=image.url"}],"slides":["https://docs.google.com/presentation/d/17hJzgcRqke4gXjKQIF_U8tyR-ssBgi593ZqVKUBVB2M/edit#slide=id.g4e7fa82987_0_58"],"links":["https://github.com/godaddy/kubernetes-external-secrets"],"videos":["https://youtu.be/heXd9HL9O8s?t=1929"]},{"title":"Code Prettier Code","extract":"L'objectif de ce talk est de montrer comment et pourquoi convaincre une équipe d'ajouter Prettier à ses projets js/ts dans le court terme. J'y démontre la valeur ajoutée de Prettier, et comment l'installer de bout en bout: comment l'ajouter au projet, l'intégrer aux linters existants, organiser la PR qui appliquera Prettier, merger facilement les branches des autres membres de l'équipe, et les meilleurs moyens de faire en sorte d'appliquer Prettier sur tous les changements futurs.\n\nL'objectif est vraiment de montrer à qui serait intéressé par Prettier, que la complexité de son ajout dans un projet, même gros, est assez réduite pour considérer de le faire sans trop attendre, et que sa valeur ajoutée en vaut le prix.\n","authors":[{"name":"Théo","url":null,"avatar":null}],"slides":["https://docs.google.com/presentation/d/1Y7QM9teTVlzu9QhcbNYTTaPBkhUbeQOed0d25fo5cL8/edit?usp=sharing"],"links":["https://github.com/teogeos/prettier-demo"],"videos":["https://youtu.be/heXd9HL9O8s?t=3600"]}]},{"id":"2018-11-28","filename":"2018-11-28.md","date":"2018-11-28","title":"meetups/2018-11-28.md","edition":"80","host":"MeilleursAgents","sponsors":[],"meetupLink":"https://www.meetup.com/Paris-js/events/251642436/","talks":[{"title":"Industrialisation des tests end-to-end via Selenium/Nightwatch/Browserstack","extract":"Pourquoi faire des tests fonctionnels via Selenium ?\nMise en place et industrialisation des tests end-to-end (Docker / Nightwatch / Browserstack)\nProblématiques rencontrées lors de tests multi-browsers.\nApproche pour des tests de non-régressions visuels\n","authors":[{"name":"Vincent Boutour","url":"https://github.com/ViBiOh","avatar":null}],"slides":["https://talks.vibioh.fr/indus_e2e/"],"links":[],"videos":["https://youtu.be/RGcARlPyw1o?t=325"]},{"title":"Les animations en React-Native","extract":"Présentation de l'API Animated pour faire des animations dans React-Native. Avec comme exemple : comment refaire un effet parallaxe au scroll bounce.\n","authors":[{"name":"Freddy Harris","url":"https://twitter.com/harrisfreddy","avatar":"https://api.microlink.io/?url=https://twitter.com/harrisfreddy&amps;embed=image.url"}],"slides":["http://react-native-animated-keynote.surge.sh/"],"links":["https://l9n55z1m0q.codesandbox.io/"],"videos":["https://youtu.be/RGcARlPyw1o?t=2390"]},{"title":"How-to: Make your application real-time","extract":"If you want to build an online chat room, a multiplayer game, or a collaborative platform in browsers, you need the power of real-time!\nThis talk will show you how to build a real-time web application with socket.io and server-send events.\n\nWhat is realtime?\nWhat makes web realtime?\nWebSocket\nsocket.io\nserver-send events\nHackMD\n","authors":[{"name":"Max","url":"https://github.com/jackycute","avatar":null}],"slides":["https://hackmd.io/p/parisjs-realtime"],"links":["https://hackmd.io"],"videos":["https://youtu.be/RGcARlPyw1o?t=3869"]}]},{"id":"2018-11-07","filename":"2018-11-07.md","date":"2018-11-07","title":"meetups/2018-11-07.md","edition":"79","host":"Chauffeur Privé","sponsors":[],"meetupLink":"https://www.meetup.com/Paris-js/events/251642421/","talks":[{"title":"Event Sourcing","extract":"TBD\n","authors":[{"name":"Hubert Mine","url":"https://github.com/hubertmine","avatar":null}],"slides":[],"links":[],"videos":["https://youtu.be/BJrhq0NHNq8"]},{"title":"JavaScript and TypeScript everywhere","extract":"JS runs in the browser, JS runs on the server, JS even run on physical devices sometimes. What if we told you that we started to run JS in other applications?\nIn this talk we (Jb Aviat, Sqreen CTO and V. de Turckheim) will show you how we use JavaScript (I mean TypeScript) to enhence the behavior of applications written in diverse languages (Ruby, Python, PHP, Java, ...). We will also talk about the issues we met when embedding a JS engine into other apps and what alternatives we looked at (SPOILER ALERT: THERE WILL BE WebAssembly).\n","authors":[{"name":"Vladimir de Turckheim","url":"http://twitter.com/poledesfetes","avatar":"https://api.microlink.io/?url=https://twitter.com/poledesfetes&amps;embed=image.url"},{"name":"Jean-Baptiste Aviat","url":"http://twitter.com/JbAviat","avatar":"https://api.microlink.io/?url=https://twitter.com/JbAviat&amps;embed=image.url"}],"slides":[],"links":[],"videos":["https://youtu.be/BJrhq0NHNq8?t=1810"]},{"title":"Vulcan.js — The fullstack React-GraphQL framework","extract":"Vulcan.JS, a fullstack GraphQL + React framework, lets you ship webapps fast, using the latest technologies. In this talk, we see the origin story of the framework and an overview of its main features\n","authors":[{"name":"Apollinaire Lecocq","url":"https://github.com/Apollinaire","avatar":null}],"slides":["https://apollinaire.github.io/vulcan-parisjs-slides"],"links":["https://github.com/VulcanJS/Vulcan","https://slack.vulcanjs.org"],"videos":["https://youtu.be/BJrhq0NHNq8?t=3212"]}]},{"id":"2018-10-24","filename":"2018-10-24.md","date":"2018-10-24","title":"meetups/2018-10-24.md","edition":"78","host":"Everoad","sponsors":[],"meetupLink":"https://www.meetup.com/Paris-js/events/251642404/","talks":[{"title":"Découvrez CQRS et Event Sourcing !","extract":"Chez Everoad, nous avons mis en place une architecture microservice basée sur les patterns CQRS et Event Sourcing. L'objectif de ce talk est de vous présenter ces deux concepts et de vous partager notre retour d'expérience sur une implémentation en full-Node.js.\n","authors":[{"name":"Yoann Gotthilf","url":null,"avatar":null}],"slides":[],"links":[],"videos":["https://youtu.be/CzToqxwwebc?t=300"]},{"title":"V8 : Master Garbage Collector","extract":"Le moteur V8 c'est un peu la magie de l'execution de javascript, côté client (chrome) et côté serveur (nodejs). Il gère pour vous la gestion de la mémoire grâce à son garbage collector !\nPourquoi un garbage collector dans V8 ?\nComprendre comment il fonctionne, quand il passe et pourquoi.\nComment optimiser son code pour ne pas créer de problème lié à la mémoire.\nComment le monitorer et obtenir des informations.\n","authors":[{"name":"Vincent Vallet","url":"http://twitter.com/vince_vallet","avatar":"https://api.microlink.io/?url=https://twitter.com/vince_vallet&amps;embed=image.url"}],"slides":["https://docs.google.com/presentation/d/17PXOZXBgdJHqBZlbULHg70_hVFLrNx9T34rB9bLDn2M/edit?usp=sharing"],"links":[],"videos":["https://youtu.be/CzToqxwwebc?t=2335"]},{"title":"Generating 3D models with Node.js","extract":"What's a 3D model? Why would you generate it with JavaScript and Node.js? How do you do that?\nLet's find out with this talk!\n","authors":[{"name":"Maurice Svay","url":"http://twitter.com/mauriz","avatar":"https://api.microlink.io/?url=https://twitter.com/mauriz&amps;embed=image.url"}],"slides":["https://docs.google.com/presentation/d/1QLnCls-OUj_iBwi-Y7oi-x2VXT20oAsZcOnJHTJKjjU/edit?usp=sharing"],"links":[],"videos":["https://youtu.be/CzToqxwwebc?t=4216"]},{"title":"Enregistrer un podcast vidéo","extract":"Pour illustrer mon projet topheman/react-fiber-experiments, j'ai récemment produit un podcast vidéo. L'idée de ce talk serait de partager rapidement :\n- la façon dont j'ai procédé\n- les outils que j'ai utilisés\n- les contraintes que je me suis imposées\n","authors":[{"name":"Christophe Rosset","url":"http://twitter.com/topheman","avatar":"https://api.microlink.io/?url=https://twitter.com/topheman&amps;embed=image.url"}],"slides":[],"links":[],"videos":["https://youtu.be/CzToqxwwebc?t=4900"]}]}]}